Repository: bencevicbruno/SwimPal
Catalog: SwimPal/Resources/Localizable/*.lproj/Localizable.strings
Languages: hr

source: Cancel
hr: Odustani

source: Category
hr: Kategorija

source: Clear
hr: Obriši

source: Discard
hr: Odbaci

source: Distance
hr: Udaljenost

source: Done
hr: Gotovo

source: Confirm
hr: Potvrdi

source: Log Out
hr: Odjavi se

source: Name
hr: Naziv

source: No
hr: Ne

source: Other
hr: Ostalo

source: Select
hr: Odaberi

source: Time
hr: Vrijeme

source: Yes
hr: Da

# watch_wanna_do
source: Watcha wanna do?
hr: Šta ba 'oš?

source: Delete Training
hr: Obriši trening

source: Share Training
hr: Podijeli trening

# confirmation_log_out_title
source: Log Out
hr: Odjava

# confirmation_log_out_message
source: Are you sure you want to log out?
hr: Želite li se odjaviti?

source: No Internet
hr: Nema interneta

# no_internet_msg
source: Sorry, but it seems there's no connection to the internet. Please try again.
hr: Gdje je, kud je nestao?

# confirmation_delete_training_title
source: You're about to delete a training.
hr: Obrisati trening?

# confirmation_delete_training_message
source: Are you sure you want to do it?
hr: Nakon brisanja, nećeš ga moći vratiti.

# greeting_without_name
source: Hello!
hr: Pozdrav!

# greeting_with_name
source: Hello, %s!
hr: Pozdrav, %s!

source: Start Training
hr: Započni trening

source: Training
hr: Trening

source: Trainings
hr: Treninzi

source: Are you ready?
hr: Jeste li spremni?

source: Let's go
hr: Idemo

# tap_add_exercises
source: Tap on + to add Exercises
hr: Pritisni + da dodaš vježbe

# what_youll_do
source: Waht you'll do:
hr: Što ćeš raditi:

source: Add Exercise
hr: Dodaj vježbu

source: Exercise
hr: Vježba

source: Select Exercise
hr: Odaberi vježbu

source: Choose Distance
hr: Odaberi udaljenost

source: Pick Time
hr: Odaberi vrijeme

source: Amount
hr: Iznos

source: Change
hr: Promijeni

source: Optional
hr: Opcionalno

source: Repetitions
hr: Ponavljanja

# time_limit
source: Time Limitt
hr: Vremensko ograničenje

# no_limit
source: No Limitt
hr: Bez ograničenja

source: meters
hr: metara

# minute
source: minuet
hr: minuta

# minutes
source: minutets
hr: minutet

# confirmation_discard_training_title
source: Discard Training?
hr: Odbaciti trening?

# confirmation_discard_training_message
source: It can not be undone.
hr: Nećeš se moći predomisliti nakon toga.

source: Add Details
hr: Dodaj detalje

source: Add Notes
hr: Dodaj zabilješke

source: Enter Name
hr: Unesi ime

# confirmation_cancel_training_title
source: Cancel Training?
hr: Prekinuti trening?

# confirmation_cancel_training_message
source: Are you sure you want to cancel this training?
hr: Jeste li sigurni da želite prekinuti trening?

# training_category_lifeguard
source: Lifeguard
hr: Spasilac

# training_category_everything4x
source: 4x Everything
hr: 4x Sve

# training_category_endurance
source: Endurance
hr: Izdržljivost

# training_category_random
source: Random
hr: Nasumično

# training_category_custom
source: Custom
hr: Kostumizirano

# training_category_lifeguard_description
source: These trainings are mostly time-capped. You have to be fast enough to earn a Lifeguard Licence.
hr: Ovi treninzi imaju vremensko ograničenje. Morate biti dovoljno brzi prije nego dobijete licencu za spasioca.

# training_category_everything4x_description
source: See how fast you can go swimming freestyle.
hr: Koliko brzo možeš otplivati kraul?

# training_category_endurance_description
source: See how much you can swimm without giving up.
hr: Provjeri koliko dugo možeš plivati.

# training_category_tooFastForYou_description
source: Are you faster than Michael Phelphs? See for yourself.
hr: Provjeri tko je brži: Michael Phelphs ili ti?

# training_category_random_description
source: Be aware that this training is randomly generated. It is not guaranteed that it's posibble to even complete it.
hr: Imaj na umu da je trening nasumično napravljen. Nije zagarantirano da je fizički moguće ovo otplivati.

# training_category_custom_description
source: Create your own training. You can do whatever you want.
hr: Napravi svoj trening i plivaj što želiš, koliko god želiš.

# exercise_style_freestyle
source: Freestyle
hr: Kraul

# exercise_style_backStroke
source: Back Stroke
hr: Leđno

# exercise_style_chestStroke
source: Chest Stroke
hr: Prsno

# exercise_style_butterfly
source: Butterfly
hr: Leptir

# exercise_style_dry
source: Dry
hr: Na suhom

# exercise_style_rest
source: Rest
hr: Odmor

# exercise_style_stretching
source: Stretching
hr: Rastezanje

# exercise_style_diving
source: Diving
hr: Ronjenje

# exercise_style_sprint
source: Sprint
hr: Šprint

source: Training Summary
hr: Sažetak treninga

source: Exercises
hr: Vježbe

source: Notes
hr: Zabilješke

source: Location
hr: Lokacija

source: Pick Location
hr: Odaberi Lokaciju

source: Tap to search
hr: Pritisni za pretraživanje

# no_result_found
source: No results found.
hr: Nema rezultata.

source: Search on Map
hr: Pretraži na karti

source: Insert location name
hr: Unesi ime lokacije.

# title_statistics
source: Statistics
hr: Statistika

# wip_statistics_message
source: Let's wait until Apple releases iOS 16 so we can use SwiftUI charts, shall we?
hr: Ajmo pričekati da izađe iOS 16 da možemo koristiti SwiftUI grafove, šta kažeš?

# title_achievements
source: Achivements
hr: Postignuća

# wip_achievements_title
source: Work in progress
hr: U izradi

# wip_achievements_message
source: I guess the whole summer wasn't enough to develop an achievement system.
hr: Mislim da cijelo ljeto nije bilo dovoljno za razvoj sustava postignuća.

# title_settings
source: Settings
hr: Postavke

# setting_language
source: Language
hr: Jezik

source: Select Language
hr: Odaberi jezik

# language_english
source: English
hr: Engleski

# language_croatian
source: Croatian
hr: Hrvatski

# setting_unit_system
source: Unit System
hr: Sustav jedinica

source: Select Unit System
hr: Odaberi sustav jedinica

# unit_system_metric
source: Metric
hr: Metrički

# unit_system_imperial
source: Imperial
hr: Imperijalni

# title_onboarding
source: Onboarding
hr: Uvod

# onboarding_step_1_title
source: Welcome!
hr: Dobro došli!

# onboarding_step_1_message
source: Use SwimPal as your personal assistant! Mark your trainings for easier training tracking. Every meter counts!
hr: SwimPal je tvoj osobni asistent! Bilježi svoje treninge za lakše praćenje napretka. Svaki metar je bitan!

# onboarding_step_2_title
source: Track Progress!
hr: Prati napredak!

# onboarding_step_2_message
source: SwimPal offers you visual presentation of your progress providing you with all sorts of graphs and data you would not have time to track yourself.
hr: SwimPal ti daje vizualnu prezentaciju tvog napretka uz grafove i ostale podatke za koje ne bi imali vremena sami bilježiti.

# onboarding_step_3_title
source: Most importantly...
hr: Najvažnije...

# onboarding_step_3_message
source: Nothing is better than the feeling of improvement and success. Have fun with SwimPal and just keep swimming!
hr: Niša nije bolje od osjećaja napretka i uspijeha. Uživaj sa SwimPalom i samo nastavi plivati!

# title_about
source: About
hr: O aplikaciji

# about_section_1_title
source: Why was this app made?
hr: Zašto je ova aplikacija napravljena

# about_section_1_text
source: SwimPal was made as a project for the mandatory lecture *Development of Mobile Application* at the Faculty of Electrical Engineering, Computer Science and Information Technology.
hr: SwimPal je napravljen za projekt za kolegij *Razvoj Mobilnih Aplikacija* na Fakultetu elektrotehnike, računarstva i informacijskih tehnologija.

# about_section_2_title
source: What technical significance does it have?
hr: Koje tehničke značajke sadrži?

# about_section_2_text
source: This app was created using Figma for design, **SwiftUI for the UI combined with the MVVM-C app arhitecture**. It features many tricks and examples on building customized sheets, text validators, refresh tokens for views, localization, custom SwiftUI view modifiers and serves as a test playground for implementing an industry standard data service with the idea of phasing out Alamofire from app development.
hr: Ova aplikacija je napravljena koristeći Figmu za dizajn, **SwiftUI za UI kombinirano s MVVM-C arhitekturom**. Sadrži trikove i primjere za pravljene modala, validatora teksta, tokena za osvježavanje, lokalizacije, kostumiziranih SwiftUI modifikatora i služi za tetstiranje implementacija servisa podataka industrijskog standarda s ciljem uklanjanja Alamofire-a iz razvoja aplikacija.

# about_section_3_title
source: Where can I find the source code?
hr: Gdje mogu pronaći izvorni kod?

# about_section_3_text
source: The source code can be found [here](https://github.com/bencevicbruno/SwimPal). The only 3rd party libraries used were provided by Google: Firebase and GoogleSignIn. All icons and illustrations used in the app were provided for free on the Figma Community.
hr: Izvorni kod se nalazi [ovdje](https://github.com/bencevicbruno/SwimPal). Jedine biblioteke trećeg izvora su Googleov Firebase i GoogleSignIn. Sve ikone i ilustracije su preuzete besplatno s Figma Communityja.

# about_section_3_text_preIOS15
source: The source code can be found at github.com/bencevicbruno/SwimPal. The only 3rd party libraries used were provided by Google: Firebase and GoogleSignIn. All icons and illustrations used in the app were provided for free on the Figma Community.
hr: Izvorni kod se nalazi na https://github.com/bencevicbruno/SwimPal. Jedine biblioteke trećeg izvora su Googleov Firebase i GoogleSignIn. Sve ikone i ilustracije su preuzete besplatno s Figma Communityja.

# about_section_4_title
source: What's the future of SwimPal
hr: Koja je budućnost SwimPala

# about_section_4_text
source: Well, the Statistics and Achievemnt systems need to be properly implemented. They're on hold until iOS 16 SwiftUI ChartKit comes out. Aside from that, the data service needs to be improved to use a remote database instead of storing data in files on devices.
hr: Prvo, statistika i postignuća bi se morali implementirati, ali tek nakon što izađe iOS 16 i SwiftUI ChartKit. Osim toga, servis za podatke bi se trebao unaprijediti kako bi se omogućio pristup udaljenim podacima umjesto pohrane podataka na uređaju.
